{
  "resultsSectionOrder": [
    "TITLE",
    "NAME",
    "INTEREST"
  ],
  "findPageMeta": {
    "searchTerm": "avengers",
    "includeAdult": false,
    "isExactMatch": false
  },
  "keywordResults": {
    "results": []
  },
  "titleResults": {
    "results": [
      {
        "id": "tt21357150",
        "titleNameText": "Avengers: Doomsday",
        "titleReleaseText": "2026",
        "titleTypeText": "",
        "titlePosterImageModel": {
          "url": "https://m.media-amazon.com/images/M/MV5BMGNiN2RlZTMtMTkyZC00YjkwLTgyY2QtMDg1ZDNhODQwNWM4XkEyXkFqcGc@._V1_.jpg",
          "maxHeight": 3840,
          "maxWidth": 2592,
          "caption": "Avengers: Doomsday (2026)"
        },
        "topCredits": [
          "Joseph Quinn",
          "Pedro Pascal"
        ],
        "imageType": "movie"
      },
      {
        "id": "tt4154796",
        "titleNameText": "Avengers: Endgame",
        "titleReleaseText": "2019",
        "titleTypeText": "",
        "titlePosterImageModel": {
          "url": "https://m.media-amazon.com/images/M/MV5BMTc5MDE2ODcwNV5BMl5BanBnXkFtZTgwMzI2NzQ2NzM@._V1_.jpg",
          "maxHeight": 2048,
          "maxWidth": 1382,
          "caption": "Michael Douglas, Samuel L. Jackson, Michelle Pfeiffer, Natalie Portman, Angela Bassett, Don Cheadle, Robert Downey Jr., William Hurt, Gwyneth Paltrow, Robert Redford, Rene Russo, Marisa Tomei, Josh Brolin, Linda Cardellini, Vin Diesel, Matthew Berry, Russell Bobbitt, Taika Waititi, Kerry Condon, Bradley Cooper, James D'Arcy, Chris Evans, Jon Favreau, Frank Grillo, Sean Gunn, Maximiliano Hernández, Ken Jeong, Scarlett Johansson, Brie Larson, Stan Lee, Elizabeth Olsen, Jimmy Ray Pickens, Chris Pratt, Jeremy Renner, Paul Rudd, Mark Ruffalo, Joe Russo, Zoe Saldana, Hiroyuki Sanada, John Slattery, Tilda Swinton, Benedict Wong, Jennifer 'Ms Fer' Russell, Camille Kinloch, Penelope Kathryn Golden, Eric Patrick Cameron, Terry Notary, Ava Russo, Jamie Wedel, Bazlo LeClair, Loen LeClair, Erica Ribley, Carlos A. Aparicio, Tom Hiddleston, Anthony Mackie, Cobie Smulders, Caleb Spencer Barr, Chris Hemsworth, Dave Bautista, Benedict Cumberbatch, Monique Ganderton, Yvette Nicole Brown, Ty Simpkins, Audrae Peterson, Evangeline Lilly, Keith Wallace, Chadwick Boseman, Kyle Banks, Sebastian Stan, Joy McAvoy, Danai Gurira, Tessa Thompson, Donald Mustard, Hayley Atwell, Karen Gillan, Tom Vaughan-Lawlor, Steven Essani, Ross Marquand, Pom Klementieff, Brian Schaeffer, Michael Pierino Miller, Keith Nussbaum, Emma Fuhrmann, Letitia Wright, Tom Holland, Jim Starlin, Anthony G Breed, Brent McGee, Ami Fujimoto, Michael James Shaw, Dustin Pitan, Carrie Coon, Eric Word, Benjamin Weaver, Mari Kasuya, Khalid Ghajji, Jaylen Davis, John Michael Morris, Hye Jin Jang, Marie Mouroum, Winston Duke, Michael A. Cook, Jackson A. Dunn, Ben Sakamoto, Brent Moorer Gaskins, Vincent Angel, Paul Pillsbury, Timothy Carr, Daniela Gaskie, Cameron Brumbelow, Kris Taylor, James Robert Taylor, Jacob Batalon, Andy Field, Renah Gallagher, Tevin Beech, Jacob Evans, Jason M. Edwards, Miles Webb, Maria Z. Wilson, Alexa Medina, Rob Romero, Cade Woodward, Shaun McMillan, Roe Dunkley, Jamaal Burcher, Kiersten Dolbec, Raul Alcantar, Greg Tiffan, Eric Wallace, Kari Yovetich, Ryan L. Price, Daniel L. Murphy, Daniel Callister, Nolan Ekberg, Kevin So, Lexi Rabe, and Robert Tinsley in Avengers: Endgame (2019)"
        },
        "topCredits": [
          "Robert Downey Jr.",
          "Chris Evans"
        ],
        "imageType": "movie"
      },
      {
        "id": "tt0848228",
        "titleNameText": "The Avengers",
        "titleReleaseText": "2012",
        "titleTypeText": "",
        "titlePosterImageModel": {
          "url": "https://m.media-amazon.com/images/M/MV5BNGE0YTVjNzUtNzJjOS00NGNlLTgxMzctZTY4YTE1Y2Y1ZTU4XkEyXkFqcGc@._V1_.jpg",
          "maxHeight": 1184,
          "maxWidth": 800,
          "caption": "Samuel L. Jackson, Robert Downey Jr., Lou Ferrigno, Chris Evans, Scarlett Johansson, Jeremy Renner, Mark Ruffalo, and Chris Hemsworth in The Avengers (2012)"
        },
        "topCredits": [
          "Robert Downey Jr.",
          "Chris Evans"
        ],
        "imageType": "movie"
      },
      {
        "id": "tt4154756",
        "titleNameText": "Avengers: Infinity War",
        "titleReleaseText": "2018",
        "titleTypeText": "",
        "titlePosterImageModel": {
          "url": "https://m.media-amazon.com/images/M/MV5BMjMxNjY2MDU1OV5BMl5BanBnXkFtZTgwNzY1MTUwNTM@._V1_.jpg",
          "maxHeight": 2048,
          "maxWidth": 1382,
          "caption": "Kenneth Branagh, Samuel L. Jackson, Don Cheadle, Robert Downey Jr., William Hurt, Gwyneth Paltrow, Josh Brolin, Benicio Del Toro, Vin Diesel, Alan Silvestri, Paul Bettany, Kerry Condon, Bradley Cooper, Keith Splinter Davis, Peter Dinklage, Idris Elba, Chris Evans, Kevin Feige, Jeffrey Ford, Keith Giffen, Sean Gunn, Scarlett Johansson, Ameenah Kaplan, Florence Kasumba, Jack Kirby, Stan Lee, Tim McAdams, Elizabeth Olsen, Chris Pratt, Mark Ruffalo, Anthony Russo, Joe Russo, Zoe Saldana, Matthew Schmidt, Joe Simon, Benedict Wong, Charles Wood, Trent Opaloch, Terry Notary, Tom Hiddleston, Anthony Mackie, Robert Pralgo, Cobie Smulders, Chris Hemsworth, Dave Bautista, Benedict Cumberbatch, Monique Ganderton, Larry Lieber, Christopher Markus, Stephen McFeely, Don Heck, Carlos Guity, Chadwick Boseman, Aaron Lazar, Sebastian Stan, Danai Gurira, Steve Englehart, Jeremy Sample, Precious Jenkins, Karen Gillan, Dominique Elijah Smith, Tom Vaughan-Lawlor, Tiffany Espensen, Steven Essani, Ross Marquand, Bill Mantlo, Matthew Zuk, Pom Klementieff, Steve Gan, Blair Jasin, Femi Olagoke, Ethan Dizon, Michael Pierino Miller, Taraja Ramsess, Jénel Stevens, Michael Anthony Rogers, Gee Alexander, Janeshia Adams-Ginyard, Letitia Wright, James Sterling, Tom Holland, Jim Starlin, Isabella Amara, Ryan Robertson, Kevin D Wilson, Daniel Graham, Joseph Singletary, Michael James Shaw, David Dman Escobar, Solomon Glave, Kevin Montgomery, Rabon Hutcherson, Carrie Coon, Martavious Cerrone Gayles, Kirk A. Jenkins, Tanya Wheelock, Andrew S. McMillan, Marcus Lewis, Donny Carrington, Gary Peebles, Floyd Anthony Johns Jr., Tye Claybrook Jr., Khalil' La'Marr Pickett, Marie Mouroum, Jazzy Ellis, Marija Juliette Abney, Phedra Syndelle, Winston Duke, Antjuan Rhames, Jefferson Lewis, Jared Moser, Zola Williams, Dawit Gulilat, Denisha Gillespie, Harrison Osterfield, James Siderits, Brandon M. Shaw, Hamid-Reza Benjamin Thompson, Chris Moore, Ariana Greenblatt, Annie Pisapia, Matthew Christensen, Simeon Freeman, Branden Arnold, Michael David Yuhl, Daniela Gaskie, Jamel D. Chambers, John Gettier, Sergio Briones, Nathaniel Perry, Jacob Batalon, Matthew Excel Simmons, Lucie Carroll, Bobby James, Bobby Hoskins, Jacob Evans, Olaniyan Thurmon, Edward Parker, Cecil M. Henry, Cory Dunson, Bruce Anthony Shepperson, Perla Middleton, Laurel O Wagner, Jachin Myers, Elgin Lee, Demetri Landell, Tony Dupar, Shawn South, Mallory Kidwell, Devin Koehler, Chase Ledgerwood, Jomahl Gildersleve, Frank David Monroe, Granger Summerset II, Austin Rospert, Lady Cardinal, Luke Maher, Laura Miller, Joe Maitland, Dylan Gajai, and Robert Tinsley in Avengers: Infinity War (2018)"
        },
        "topCredits": [
          "Robert Downey Jr.",
          "Chris Hemsworth"
        ],
        "imageType": "movie"
      },
      {
        "id": "tt2395427",
        "titleNameText": "Avengers: Age of Ultron",
        "titleReleaseText": "2015",
        "titleTypeText": "",
        "titlePosterImageModel": {
          "url": "https://m.media-amazon.com/images/M/MV5BODBhYTg1NGQtNGVmNS00ZTdiLThjYTYtZDFkNzRiNTZmNDZjXkEyXkFqcGc@._V1_.jpg",
          "maxHeight": 1280,
          "maxWidth": 864,
          "caption": "Samuel L. Jackson, Robert Downey Jr., James Spader, Paul Bettany, Chris Evans, Scarlett Johansson, Elizabeth Olsen, Jeremy Renner, Mark Ruffalo, Aaron Taylor-Johnson, and Chris Hemsworth in Avengers: Age of Ultron (2015)"
        },
        "topCredits": [
          "Robert Downey Jr.",
          "Chris Evans"
        ],
        "imageType": "movie"
      }
    ],
    "nextCursor": "eyJlc1Rva2VuIjpbIjk0MzcxLjgwNSIsInR0MjM5NTQyNyJdLCJmaWx0ZXIiOiJ7XCJpbmNsdWRlQWR1bHRcIjpmYWxzZSxcImlzRXhhY3RNYXRjaFwiOmZhbHNlLFwic2VhcmNoVGVybVwiOlwiYXZlbmdlcnNcIixcInR5cGVcIjpbXCJUSVRMRVwiXX0ifQ==",
    "hasExactMatches": true
  },
  "nameResults": {
    "results": [
      {
        "id": "nm5314227",
        "displayNameText": "Avengers",
        "knownForJobCategory": "Transportation Department",
        "knownForTitleText": "Cowboys & Aliens",
        "knownForTitleYear": "2011"
      },
      {
        "id": "nm13361757",
        "displayNameText": "Marvel Avengers",
        "knownForJobCategory": 0,
        "knownForTitleText": 0,
        "knownForTitleYear": 0
      },
      {
        "id": "nm13990159",
        "displayNameText": "The Avengers",
        "knownForJobCategory": "Self",
        "knownForTitleText": "Showcase",
        "knownForTitleYear": "1965–1970"
      },
      {
        "id": "nm0828447",
        "displayNameText": "Inger Stevens",
        "knownForJobCategory": "Actress",
        "knownForTitleText": "Hang 'Em High",
        "knownForTitleYear": "1968",
        "avatarImageModel": {
          "url": "https://m.media-amazon.com/images/M/MV5BMTI3MTk0NDg1M15BMl5BanBnXkFtZTcwNzQ1MTgyMQ@@._V1_.jpg",
          "maxHeight": 280,
          "maxWidth": 200,
          "caption": "Inger Stevens"
        }
      },
      {
        "id": "nm3433559",
        "displayNameText": "The Whiskey Avengers",
        "knownForJobCategory": "Soundtrack",
        "knownForTitleText": "Craigslist Joe",
        "knownForTitleYear": "2012"
      }
    ],
    "nextCursor": "eyJlc1Rva2VuIjpbIjE0NDkuMjczMSIsIm5tMzQzMzU1OSJdLCJmaWx0ZXIiOiJ7XCJpbmNsdWRlQWR1bHRcIjpmYWxzZSxcImlzRXhhY3RNYXRjaFwiOmZhbHNlLFwic2VhcmNoVGVybVwiOlwiYXZlbmdlcnNcIixcInR5cGVcIjpbXCJOQU1FXCJdfSJ9",
    "hasExactMatches": true
  },
  "companyResults": {
    "results": []
  }
}